  // 0. Демонстрация решения
  // Напишите программу, которая на вход 
  // принимает число и выдает его квадрат (чмисло умноженноое на сомо себя).
  // Напримет 
  // 4->16
  //-3->9
  //-7-49



int num = 4;
int square = num * num;

Console.WriteLine(square);

//Console.ReadLine();
